**`teams/delius-iaps/iaps_server`** terragrunt plan on `push` event [#112](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_ndelius_interface.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.2/1"
        name                  = "delius_iaps_install_oracle_sql_developer"
      + supported_os_versions = []
        tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.2"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.3"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.2"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
            "image-recipe"                                       = "delius_iaps_server/0.0.19"
            "infrastructure-configuration"                       = "delius_iaps_server/0.0.19"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1"
        name                  = "add_net_framework_features"
      ~ tags                  = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-cloudwatch-agent/0.1.1/1"
        name                  = "delius_iaps_configure_cloudwatch_agent"
      ~ tags                  = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-odbc-dsn/0.1.0/1"
        name                  = "delius_iaps_configure_odbc_dsn"
      ~ tags                  = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.2/1"
        name                  = "delius_iaps_install_base_packages"
      ~ tags                  = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.1/1"
        name                  = "delius_iaps_install_im_interface"
      ~ tags                  = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_ndelius_interface.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-ndelius-interface/0.1.3/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: delius_iaps_install_ndelius_interface
            description: Installs delius_iaps_install_ndelius_interface
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.1.3
          +       default: 0.1.4
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
              - S3ArtefactBucket:
                  type: string
                  description: Name of s3 bucket holding software artefacts
            phases:
              - name: build
                steps:
                  - name: DownloadArtefacts
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Read-S3Object -BucketName {{ S3ArtefactBucket }} -KeyPrefix "delius-iaps/apps/ndelius-interface/" -Folder " ${env:TEMP}\ndelius-interface"
                  - name: InstallNDeliusInterface
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Start-Process -Wait -FilePath "${env:TEMP}\ndelius-interface\setup.exe" -ArgumentList "/quiet /qn" -Verb RunAs
                          New-Item -ItemType Junction -Path "C:\Program Files\I2N\IapsNDeliusInterface" -Target "C:\Program Files (x86)\I2N\IapsNDeliusInterface"
                  - name: RemoveInvalidShortcut
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          Write-Host('Grant local Users group full access recursively to I2N program dir')
                          $i2npath = "C:\Program Files (x86)\I2N"
                          $acl = (Get-Item $i2npath).GetAccessControl('Access')
                          $rule = New-Object System.Security.AccessControl.FileSystemAccessRule("Users", "FullControl", "ContainerInherit,ObjectInherit", "None", "Allow")
                          $acl.SetAccessRule($rule)
                          Set-Acl $i2npath $acl
            
          -               Write-Host('Remove invalid shortcut')
          +               Write-Host('Remove invalid shortcuts')
                          if ( Test-Path "C:\Users\Public\Desktop\Migration Utility (Iaps-NDelius IF).lnk") {
                            Remove-Item -Path "C:\Users\Public\Desktop\Migration Utility (Iaps-NDelius IF).lnk"
                          }
          +               if ( Test-Path "C:\Users\Public\Desktop\Iaps-PCMS Interface Console.lnk") {
          +                 Remove-Item -Path "C:\Users\Public\Desktop\Iaps-PCMS Interface Console.lnk"
          +               }
            
                          Write-Host('Creating new shortcut for all users')
                          $iapsapp = "C:\Program Files (x86)\I2N\IapsNDeliusInterface\PCMSIfConsole.exe"
                          $iapsshortcut = "C:\Users\Public\Desktop\PCMSIfConsole.lnk"
                          $WshShell = New-Object -comObject WScript.Shell
                          $Shortcut = $WshShell.CreateShortcut("$iapsshortcut")
                          $Shortcut.TargetPath = $iapsapp
                          $Shortcut.Save()
            
                          Write-Host('Setting RunAs Adminisrator flag on new shortcut')
                          $bytes = [System.IO.File]::ReadAllBytes("$iapsshortcut")
                          $bytes[0x15] = $bytes[0x15] -bor 0x20 #set byte 21 (0x15) bit 6 (0x20) ON
                          [System.IO.File]::WriteAllBytes("$iapsshortcut", $bytes)
                  - name: DownloadXMLConfigFiles
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Invoke-WebRequest -Uri "https://github.com/ministryofjustice/modernisation-platform-ami-builds/raw/main/teams/delius-iaps/components/files/IAPSCMSIF.xml" -OutFile "C:\Program Files (x86)\I2N\IapsNDeliusInterface\Config\IAPSCMSIF.xml"
                          Invoke-WebRequest -Uri "https://github.com/ministryofjustice/modernisation-platform-ami-builds/raw/main/teams/delius-iaps/components/files/NDELIUSIF.xml" -OutFile "C:\Program Files (x86)\I2N\IapsNDeliusInterface\Config\NDELIUSIF.xml"
        EOT
      ~ date_created          = "2023-03-13T15:55:03.119Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-ndelius-interface/0.1.3/1" -> (known after apply)
        name                  = "delius_iaps_install_ndelius_interface"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.1.3" -> "0.1.4" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.1/1"
        name                  = "delius_iaps_install_oracle_db_client_tools"
      ~ tags                  = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.2/1"
        name                  = "delius_iaps_install_oracle_sql_developer"
      ~ tags                  = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_set_system_locale.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: delius_iaps_set_system_locale
            description: Sets locale to values requested by
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.1.0
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
            phases:
              - name: build
                steps:
                  - name: SetGBLocale
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Set-WinSystemLocale -SystemLocale en-GB
                          Set-WinHomeLocation -GeoId 242
                          Set-WinUserLanguageList -LanguageList (New-WinUserLanguageList -Language en-GB) -Force
        EOT
      + date_created = (known after apply)
      + description  = "Sets locale to values requested by"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "delius_iaps_set_system_locale"
      + owner        = (known after apply)
      + platform     = "Windows"
      + skip_destroy = false
      + tags         = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
          + "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
          + "delius_iaps_install_base_packages-version"          = "0.1.2"
          + "delius_iaps_install_im_interface-version"           = "0.1.1"
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
          + "delius_iaps_install_oracle_sql_developer-version"   = "0.1.2"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.20"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.20"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + tags_all     = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
          + "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
          + "delius_iaps_install_base_packages-version"          = "0.1.2"
          + "delius_iaps_install_im_interface-version"           = "0.1.1"
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
          + "delius_iaps_install_oracle_sql_developer-version"   = "0.1.2"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.20"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.20"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + type         = (known after apply)
      + version      = "0.1.0"
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
        name         = "delius_iaps_server"
      ~ tags         = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ date_created                     = "2023-03-14T12:04:00.761Z" -> (known after apply)
      ~ date_last_run                    = "2023-03-14T12:04:48.893Z" -> (known after apply)
      ~ date_next_run                    = "2023-04-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-03-14T12:04:00.761Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.19" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-19" -> (known after apply)
        name                             = "delius_iaps_server"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.19" -> (known after apply)
      ~ date_created      = "2023-03-14T12:03:58.502Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.19" -> (known after apply)
        name              = "delius_iaps_server"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.19" -> "0.0.20" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/xvdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - snapshot_id           = "snap-04435aa8246764616" -> null
              - throughput            = 0 -> null
              - volume_size           = 7 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/xvdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + snapshot_id           = "snap-04435aa8246764616"
              + volume_size           = 7
              + volume_type           = "gp3"
            }
        }

      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1" -> (known after apply) # forces replacement
        }
      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.2/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1" # forces replacement
        }
      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.1/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.2/1" # forces replacement

          - parameter { # forces replacement
              - name  = "S3ArtefactBucket" -> null
              - value = "mod-platform-image-artefact-bucket20230203091453221500000001" -> null
            }
        }
      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-odbc-dsn/0.1.0/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.1/1" # forces replacement

          + parameter { # forces replacement
              + name  = "S3ArtefactBucket"
              + value = "mod-platform-image-artefact-bucket20230203091453221500000001"
            }
        }
      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.2/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-odbc-dsn/0.1.0/1" # forces replacement

          - parameter { # forces replacement
              - name  = "S3ArtefactBucket" -> null
              - value = "mod-platform-image-artefact-bucket20230203091453221500000001" -> null
            }
        }
      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.1/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.2/1" # forces replacement

            # (1 unchanged block hidden)
        }
      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-cloudwatch-agent/0.1.1/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.1/1" # forces replacement

          + parameter { # forces replacement
              + name  = "S3ArtefactBucket"
              + value = "mod-platform-image-artefact-bucket20230203091453221500000001"
            }
        }
      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-ndelius-interface/0.1.3/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-cloudwatch-agent/0.1.1/1" # forces replacement

          - parameter { # forces replacement
              - name  = "S3ArtefactBucket" -> null
              - value = "mod-platform-image-artefact-bucket20230203091453221500000001" -> null
            }
        }
      + component { # forces replacement
          + component_arn = (known after apply) # forces replacement

          + parameter { # forces replacement
              + name  = "S3ArtefactBucket"
              + value = "mod-platform-image-artefact-bucket20230203091453221500000001"
            }
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-19" -> (known after apply)
      ~ date_created                  = "2023-03-14T12:03:51.503Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-19" -> (known after apply)
      ~ name                          = "delius_iaps_server_0_0_19" -> "delius_iaps_server_0_0_20" # forces replacement
      ~ resource_tags                 = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "delius_iaps_install_ndelius_interface-version"      = "0.1.3" -> "0.1.4"
          + "delius_iaps_set_system_locale-version"              = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.19" -> "delius_iaps_server/0.0.20"
            # (18 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 8 to change, 4 to destroy.

```
